[
  {
    "id": 1,
    "titulo": "HTML5",
    "texto": "# HTML5\n\nHypertext Markup Language, version 5 (**HTML5**) is a markup language for the World Wide Web and a key Internet technology, originally proposed by Opera Software. It is the fifth version of the HTML language. This version brings important changes regarding the role of HTML in the web world, through new features such as semantics and accessibility.\n\n**Where was it applied?**\n\n![Image 1](/assets/posts/fiaplogo.png)\n![Image 2](/assets/posts/itpowerlogo.png)\n![Image 3](/assets/posts/aluralogo.png)"
  },
  {
    "id": 2,
    "titulo": "React.Js",
    "texto": "# React\n\nReact (also called React.js or ReactJS) is an open-source front-end JavaScript library focused on creating user interfaces for web pages, created in 2011 by Facebook, aimed at optimizing updates and synchronization of simultaneous activities in the social network news feed and improving code maintenance through the creation of declarative views and components.\n\n**Where was it applied?**\n\n![Image 1](/assets/posts/fiaplogo.png)\n![Image 3](/assets/posts/aluralogo.png)\n\n**How was it used?**\n\nCurrently at an academic level, I use React.js to create some applications to improve my knowledge of it. These pages were created 100% in React."
  },
  {
    "id": 3,
    "titulo": "Bootstrap",
    "texto": "# Bootstrap\n\nBootstrap is an open-source web framework for developing front-end interface components for websites and web applications using HTML, CSS, and JavaScript. It is based on design templates for typography, enhancing the user experience on a friendly and responsive site.\n\n**Where was it applied?**\n\n![Image 2](/assets/posts/itpowerlogo.png)\n![Image 3](/assets/posts/aluralogo.png)\n\n**How was it used?**\n\nUsed in most of the projects I worked on at It Power Software, both internal and external. One of the styling frameworks I am most familiar with."
  },
  {
    "id": 4,
    "titulo": "JavaScript",
    "texto": "# JavaScript\n\nJavaScript (often abbreviated as JS) is a high-level, interpreted, weakly typed, multi-paradigm programming language (prototypal, object-oriented, imperative, and functional). Along with HTML and CSS, JavaScript is one of the three main technologies of the World Wide Web. JavaScript enables interactive web pages and is therefore an essential part of web applications.\n\n**Where was it applied?**\n\n![Image 1](/assets/posts/fiaplogo.png)\n![Image 2](/assets/posts/itpowerlogo.png)\n![Image 3](/assets/posts/aluralogo.png)\n\n**How was it used?**\n\nI gained extensive experience with it during my time at It Power Software. Used in both Front-End and Back-End, as well as automation and execution of routines."
  },
  {
    "id": 5,
    "titulo": "Node.Js",
    "texto": "# Node.js\n\nNode.js is an open-source, cross-platform software based on Google's V8 engine that allows the execution of JavaScript code outside a web browser.\n\n**Where was it applied?**\n\n![Image 1](/assets/posts/fiaplogo.png)\n![Image 3](/assets/posts/aluralogo.png)\n\n**How was it used?**\n\nCurrently at an academic level, it was initially introduced to me at university. I now use it to develop some applications for study purposes and to improve my existing knowledge."
  },
  {
    "id": 6,
    "titulo": "SQLServer",
    "texto": "# Microsoft SQL Server\n\nMicrosoft SQL Server is a relational database management system (RDBMS) developed by Sybase in partnership with Microsoft.\n\n**Where was it applied?**\n\n![Image 1](/assets/posts/fiaplogo.png)\n![Image 2](/assets/posts/itpowerlogo.png)\n\n**How was it used?**\n\nMain database used during my time at It Power Software, storing data for almost all the projects I was involved in, both in PROD and UAT environments. Familiar with its main functions, except for executing/modifying procedures (currently under study)."
  },
  {
    "id": 7,
    "titulo": "Postman",
    "texto": "# Postman\n\nPostman is a platform and tool that allows developers to create, test, document, and share APIs collaboratively and efficiently. It simplifies sending HTTP/HTTPS requests, analyzing responses, automating tests, and team collaboration, acting as a \"browser for APIs\" that facilitates working with different types of APIs and data formats.\n\n**Where was it applied?**\n\n![Image 2](/assets/posts/itpowerlogo.png)\n\n**How was it used?**\n\nUsed by me at It Power Software to test requests and email sending that could not be executed via the interface, as they consumed an internal endpoint."
  },
  {
    "id": 8,
    "titulo": "SoapUI",
    "texto": "# SoapUI\n\nSoapUI is an open-source tool developed in Java, used to test APIs and web services, including SOAP, REST, and others. It offers features for functional, load, and security testing, allowing automation of tests, inspection and simulation of services, and validation of requests and responses.\n\n**Where was it applied?**\n\n![Image 2](/assets/posts/itpowerlogo.png)\n\n**How was it used?**\n\nUsed to test specific service requests we provided, particularly to simulate the submission of claims and their data."
  }
]
