[
  {
    "id": 1,
    "titulo": "HTML5",
    "texto": "# HTML5\n\nHTML5 (Hypertext Markup Language, versão 5) é uma linguagem de marcação para a World Wide Web e é uma tecnologia chave da Internet, originalmente proposta por Opera Software. É a quinta versão da linguagem HTML. Esta versão traz consigo importantes mudanças quanto ao papel do HTML no mundo da Web, através de novas funcionalidades como semântica e acessibilidade.\n\nAplicado em:\n\n![Imagem 1](/assets/posts/fiaplogo.png)\n![Imagem 2](/assets/posts/itpowerlogo.png)\n![Imagem 3](/assets/posts/aluralogo.png)"
  },
  {
    "id": 2,
    "titulo": "React.Js",
    "texto": "# React\n\nO React (também denominado React.js ou ReactJS) é uma biblioteca front-end JavaScript de código aberto com foco em criar interfaces de usuário em páginas web, criado em 2011 pelo Facebook, com o objetivo de otimizar a atualização e a sincronização de atividades simultâneas no feed de notícias da rede social e melhorar a manutenção de código, com a criação de views declarativas e componentes.\n\nAplicado em:\n\n![Imagem 1](/assets/posts/fiaplogo.png)\n![Imagem 3](/assets/posts/aluralogo.png)"
  },
  {
    "id": 3,
    "titulo": "Bootstrap",
    "texto": "# Bootstrap\n\nBootstrap é um framework web com código-fonte aberto para desenvolvimento de componentes de interface e front-end para sites e aplicações web, usando HTML, CSS e JavaScript, baseado em modelos de design para a tipografia, melhorando a experiência do usuário em um site amigável e responsivo.\n\nAplicado em:\n\n![Imagem 2](/assets/posts/itpowerlogo.png)\n![Imagem 3](/assets/posts/aluralogo.png)"
  },
  {
    "id": 4,
    "titulo": "JavaScript",
    "texto": "# JavaScript\n\nJavaScript (frequentemente abreviado como JS) é uma linguagem de programação interpretada estruturada, de script em alto nível com tipagem dinâmica fraca e multiparadigma (protótipos, orientado a objeto, imperativo e funcional). Juntamente com HTML e CSS, o JavaScript é uma das três principais tecnologias da World Wide Web. JavaScript permite páginas da Web interativas e, portanto, é uma parte essencial dos aplicativos da web.\n\nAplicado em:\n\n![Imagem 1](/assets/posts/fiaplogo.png)\n![Imagem 2](/assets/posts/itpowerlogo.png)\n![Imagem 3](/assets/posts/aluralogo.png)"
  },
  {
    "id": 5,
    "titulo": "Node.Js",
    "texto": "# Node.js\n\nNode.js é um software de código aberto, multiplataforma, baseado no interpretador V8 do Google e que permite a execução de códigos JavaScript fora de um navegador web.\n\nAplicado em:\n\n![Imagem 1](/assets/posts/fiaplogo.png)\n![Imagem 3](/assets/posts/aluralogo.png)"
  },
  {
    "id": 6,
    "titulo": "SQLServer",
    "texto": "# Microsoft SQL Server\n\nMicrosoft SQL Server é um sistema gerenciador de Banco de dados relacional (SGBD) desenvolvido pela Sybase em parceria com a Microsoft.\n\nAplicado em:\n\n![Imagem 1](/assets/posts/fiaplogo.png)\n![Imagem 2](/assets/posts/itpowerlogo.png)"
  },
  {
    "id": 7,
    "titulo": "Postman",
    "texto": "# Postman\n\nO Postman é uma plataforma e uma ferramenta que permite a desenvolvedores criar, testar, documentar e compartilhar APIs de forma colaborativa e eficiente. Ele simplifica o envio de requisições HTTP/HTTPS, a análise de respostas, a automação de testes e a colaboração em equipe, servindo como um \"navegador para APIs\" que facilita o trabalho com diferentes tipos de APIs e formatos de dados.\n\nAplicado em:\n\n![Imagem 2](/assets/posts/itpowerlogo.png)"
  },
   {
    "id": 8,
    "titulo": "SoapUI",
    "texto": "# SoapUI\n\nSoapUI é uma ferramenta de código aberto, desenvolvida em Java, utilizada para testar APIs e serviços web, incluindo os de protocolo SOAP, REST e outros. Ela oferece funcionalidades para testes funcionais, de carga e de segurança, permitindo a automação de testes, a inspeção e simulação de serviços e a validação de requisições e respostas.\n\nAplicado em:\n\n![Imagem 2](/assets/posts/itpowerlogo.png)"
  }
]

